<?php

$subjects = ["Московская область" => ["Москва", "Зеленоград", "Клин"], 
"Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
"Новосибирская область" => ["Новосибирк", "Искитим", "Бердск"], 
"Амурская область" => ["Благовещенск", "Райчихинск", "Свободный"]];

foreach ($subjects as $region => $city){
        echo("<br>$region:<br>");
        foreach ($city as $key => $town){
                echo("$town ");
        }
}

?>

<br>
<br>

<?php

//---------------------------8-----------------------------//

foreach ($subjects as $region => $city){
    foreach ($city as $key => $town){
        if(mb_substr($town, 0, 1) == "К"){
            echo "$town<br>";
        }
    }
}
